[
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk0",
    "text": "Quest name: The Path to Hogwarts[22] Location: Highlands Notes: Professor Fig and I have travelled viaPortkeyto a remote cliffside in the Scottish Highlands. We need to explore the mysterious ruins that we suspect the Portkey was meant to lead us to.Explore the ruins Quest name: Welcome to Hogwarts Location: Notes: Quest name: Charms Class[24] Location: The Astronomy Wing Notes: The Field Guide Map show Professor Ronen's class is in the Astronomy Wing.This castle is enormous! I may need to use the Charmed Compass in the Field Guide to help me find the way.Go to Charms classRewards:Accio Quest name: Defence Against the Dark Arts Class[25] Location: The Astronomy Wing Notes: The Field Guide Map shows Professor Hecat's class is in the lower section of the Astronomy Wing.I could get lost in this castle. I may need to use the Charmed compass in the Field Guide to help me find the way.Attend Defence Against the Dark Arts ClassRewards: Levioso Quest name: Weasley After Class[26] Location: Transfiguration classroom Notes: Professor Weasley wants to see me in her classroom which is off the Transfiguration Courtyard, located between the Library Annex and the Astronomy Wing. Hopefully she has word on replacing my lost supplies.Meet Professor Weasley in the Transfiguration classroomRequirements: 2 - Required Level Quest name: Welcome to Hogsmeade[27] Location: Near the entrance to Hogwarts Notes: Professor Weasley has arranged for me to visit the nearby village of Hogsmeade and replace my lost supplies. I should be able to navigate to the different shops using my map. Natty Onai/Sebastian Sallow will keep me company along the way.Meet Natty near the entrance to HogwartsRequirements: 2 - Required Level, ReparoRewards: Ancient Magic Throw, Ancient Magic Quest name: The Locket's Secret Location: Notes: Quest name: Secrets of the Restricted Section[29] Location: Notes: Requirements: 3 - Required Level, IncendioRewards: Disillusionment Quest name: Tomes and Tribulations Location: Professor Fig's office Notes: Quest name: The Girl fromUagadou[31] Location: Lower Hogsfield Notes: Natty Onai has asked me to meet her at a hamlet called Lower Hogsfield, just south of Hogwarts. I should see what she wants.Meet Natty Onai in Lower HogsfieldRequirements: 4 - Required Level Quest name: Trials of Merlin[citation needed] Location: Notes: Quest name: Herbology Class[32] Location: Greenhouses Notes: I need to attend Herbology class, taught by Professor Garlick in the Greenhouses.Go to Herbology classRequirements: 3 - Required Level Quest name: Potions Class[33] Location: Notes: The next class I must attend is Potions. It is taught by Professor Sharp.Attend Potions ClassRequirements: 4 - Required Level Quest name: Ollivander's Heirloom[35] Location: Hogsmeade Notes: Mr Ollivander, the wandmaker in Hogsmeade, wants to see me about something. I should pay him a visit.Visit Mr Ollivander in HogsmeadeRequirements: 5 - Required Level Quest name: Scrope's Last Hope[citation needed] Location: Notes: Quest name: The Hunt for the Missing Pages Location: Notes: Nearly Headless Nick may have information regarding the missing pages I seek.Speak to Nearly Headless NickRequirements: 5 - Required Level Quest name: Jackdaw's Rest[36] Location: Forbidden Forest Notes: The ghost of Richard Jackdaw is going"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk1",
    "text": "Last Hope[citation needed] Location: Notes: Quest name: The Hunt for the Missing Pages Location: Notes: Nearly Headless Nick may have information regarding the missing pages I seek.Speak to Nearly Headless NickRequirements: 5 - Required Level Quest name: Jackdaw's Rest[36] Location: Forbidden Forest Notes: The ghost of Richard Jackdaw is going to meet me at the edge of the Forbidden Forest. He said he'll show me how to get to the cave where he died. He's certain the missing pages are still there with his decapitated remains.Meet Richard Jackdaw at the Forbidden ForestFollow Jackdaw through the Forbidden ForestFind the cave where Richard Jackdaw diedWhisper the passwordInvestigate the cave where Jackdaw diedDefeat Ranrok's LoyalistsFind the missing pagesDefend yourself against the Ancient DefendersInvestigate the traces of ancient magicExit the Map ChamberRequirements: Expelliarmus Quest name: Flying Class[37] Location: Notes: In today's Flying class, Madam Kowaga is reviewing basic broom flight and manoeuvrability.Go to Flying classFly through the rings (0/3)Fly through the rings around the groundsFollow Everett CloptonReturn to the CourtyardLand and dismountRequirements: 6 - Required Level Quest name: In the Shadow of the Undercroft[38] Location: Defence Against the Dark Arts classroom Notes: I can probably find Sebastian at his usual spot near the Defence Against the Dark Arts classroom.Meet SebastianRequirements: 8 - Required LevelRewards: Confringo Quest name: The Map Chamber[citation needed] Location: Notes: Quest name: Percival Rackham's Trial[citation needed] Location: Notes: Quest name: The Room of Requirement[39] Location: Astronomy Tower Notes: Professor Weasley has requested I meet her in the seventh-floor cooridor of the Astronomy Tower. This is an odd location for a meeting. I wonder what she wants.Meet with Professor WeasleyRequirements: 6 - Required LevelRewards: Conjuring Spell, Evanesco, Conjuration Spellcraft Quest name: Beasts Class Location: Notes: I need to attend Beasts class, taught by Professor HowinGo to Beasts classRequirements: 13 - Required Level Quest name: The Caretaker'sLunarLament Location: The Grand Staircase Notes: Gladwin Moon, the Hogwarts caretaker, wishes to speak with me about something. I should find him near the Reception Hall.Talk to Gladwin MoonRewards: Alohomora Quest name: The Helm of Urtkot Location: Notes: I need to travel to Hogsmeade. I should be able to find Sirona inside the Three BroomsticksSpeak to Sirona in the Three BroomsticksRequirements: 12 - Required Level,Depulso Quest name: In the Shadow of the Estate[citation needed] Location: Notes: Quest name: The Elf, the Nab-Sack, and the Loom[citation needed] Location: Notes: Quest name: The High Keep[citation needed] Location: Notes: Quest name: Astronomy Class[citation needed] Location: Notes: Quest name: Back on the Path[citation needed] Location: Notes: Quest name: Charles Rookwood's Trial[citation needed] Location: Notes: Quest name: Fire and Vice[citation needed] Location: Notes: Quest name: In the Shadow of the Mine[citation needed] Location: Notes: Quest name: It's All Gobbledegook[citation needed] Location: Notes: Quest name: The Headmistress Speaks[citation needed] Location: Notes: Quest name: The Polyjuice Plot[citation needed] Location: Notes: Quest name: Niamh Fitzgerald's Trial[citation needed] Location: Notes: Quest name: In the Shadow of the Mountain[citation needed] Location: Notes: Quest name: Lodgok's Loyalty[citation needed] Location: Notes: Quest name: San Bakar's Trial[citation needed] Location: Notes:"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk2",
    "text": "Quest name: The Headmistress Speaks[citation needed] Location: Notes: Quest name: The Polyjuice Plot[citation needed] Location: Notes: Quest name: Niamh Fitzgerald's Trial[citation needed] Location: Notes: Quest name: In the Shadow of the Mountain[citation needed] Location: Notes: Quest name: Lodgok's Loyalty[citation needed] Location: Notes: Quest name: San Bakar's Trial[citation needed] Location: Notes: Quest name: Wand Mastery[citation needed] Location: Notes: Quest name: The Final Repository[citation needed] Location: Notes: Quest name: Weasley's Watchful Eye[citation needed] Location: Notes: Quest name: The House Cup[citation needed] Location: Notes: Quest name: Madam Kogawa's Assignment 1 Location: Notes: Madam Kogawa has conjured a number of balloons around the Hogsmeade Station and the Quidditch pitch. She wants me to use my broom to reach and pop them.Pop balloons over Hogsmeade Station (0/5)Pop balloons around the Quidditch Pitch (0/5)Rewards:Glacius Quest name: Madam Kogawa's Assignment 2 Location: Notes: Quest name: Professor Garlick's Assignment 1 Location: Notes: Professor Garlick wants me to field test a Venomous Tentacula and a Mandrake. Should I need any seeds or plants, I can visit Dogweed and Deathcap. My Field Guide will not guide me through this assignment, but my map could still prove useful.Acquire and use a Venomous TentaculaAcquire and use a Mandrake on multiple enemies simultaneouslyRewards:Wingardium Leviosa Quest name: Professor Garlick's Assignment 2 Location: Notes: Quest name: Professor Hecat's Assignment 1[40] Location: Defence Against the Dark Arts classroom Notes: Professor Hecat would like to see me about some additional assignments.Report to Professor HecatWin two rounds of Crossed Wands[41]Complete a round of spell combination practice with Lucan Brattleby[41]Return to Professor HecatRewards:Incendio Quest name: Professor Hecat's Assignment 2[42] Location: Notes: Professor Hecat wants me to practise avoiding attacks by dodge rolling. She also wants me to cast Incendio on a few enemies. My Field Guide will not guide me through this assignment, but my map could still prove useful.Successfully avoid enemy attacks by dodge rolling (0/10)Cast Incendio on enemies (0/5)Rewards:Expelliarmus Quest name: Professor Onai's Assignment Location: Notes: Professor Onai wants me to field testDepulsoon a levitated enemy. She also wants me to collectTrollbogeys, so I will need to find and defeat a Troll to complete her assignment. MyField Guidewill not guide me through this assignment, but my map could still prove useful.Collect Troll Bogeys (0/1)Cast Depulso on a levitated enemyRewards:Descendo Quest name: Professor Ronen's Assignment[43] Location: Transfiguration Courtyard Notes: Professor Ronen would like to speak with me about some additional assignments.Report to Professor RonenCollect the flying page near the broken statueCollect the flying page in the Defence Against the Dark Arts TowerRewards:Reparo Quest name: Professor Sharp's Assignment 1[44] Location: Notes: Professor Sharp wants me to test myself while under the influence of both the Maxima and Edurus Potions. He'd also like me to field test a Focus Potion. I know to find potions and recipes at J. Pippins Potions. Myg Field Guide will not guide me through this assignment, but my map could still prove useful.Acquire and use a Focus PotionAcquire Maxima and Edurus Potions, and use them simultaneouslyRewards:Depulso Quest name: A Basis for Blackmail[citation needed] Location: Hogsmeade"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk3",
    "text": "I know to find potions and recipes at J. Pippins Potions. Myg Field Guide will not guide me through this assignment, but my map could still prove useful.Acquire and use a Focus PotionAcquire Maxima and Edurus Potions, and use them simultaneouslyRewards:Depulso Quest name: A Basis for Blackmail[citation needed] Location: Hogsmeade Notes: Natty wants me to speak with the late Mr Bickle's associates to see what information they have on Harlow. I should be able to find them in Hogsmeade. Quest name: A Bird in the Hand[citation needed] Location: Notes: Quest name: A Dragon Debrief[citation needed] Location: Notes: Quest name: Acting on Instinct[citation needed] Location: Notes: Quest name: Finding Focus[citation needed] Location: Notes: Quest name: Grief and Vengeance[citation needed] Location: Notes: Quest name: Harlow's Last Stand[citation needed] Location: Notes: Quest name: In the Shadow of Distance[citation needed] Location: Notes: Quest name: In the Shadow of Fate[citation needed] Location: Notes: Quest name: In the Shadow of Friendship[citation needed] Location: Notes: Quest name: In the Shadow of Hope[citation needed] Location: Notes: Quest name: In the Shadow of Discovery[citation needed] Location: Notes: Sebastian sent me an owl saying he found something interesting in the book from the Scriptorium and he wants to discuss it in the Undercroft.Speak with Sebastian in the Undercroft Quest name: In the Shadow of the Bloodline[citation needed] Location: Notes: Quest name: In the Shadow of the Relic[citation needed] Location: Notes: Quest name: In the Shadow of the Study[citation needed] Location: Notes: Quest name: In the Shadow of Time[citation needed] Location: Notes: Quest name: It's in the Stars[citation needed] Location: Notes: Quest name: Mum's the Word[citation needed] Location: Notes: Quest name: Poached Egg[citation needed] Location: Notes: Quest name: Poppy Blooms[citation needed] Location: Notes: Quest name: Surprise Meeting[citation needed] Location: Notes: Quest name: The Centaur and the Stone Location: Feldcroft Notes: Poppy sent me an owl saying that she wants to meet near Irondale at a cave south of Hogwarts. Quest name: The Lost Child[citation needed] Location: Notes: Quest name: The Poachers' House Call[citation needed] Location: Notes: Quest name: Absconder Encounter Location: Notes: Quest name: Breaking Camp Location: Notes: Quest name: Brother's Keeper Location: Notes: Quest name: Cache in the Castle Location: Notes: The first clue shows arhinocerosskeleton on display. I know I must have walked by that at least a dozen times. Now if only I could remember where it is.Find the first landmark from Arthur's Treasure Map Quest name: Carted Away Location: Lower Hogsfield Notes: Agoblinoutside of Lower Hogsfield seems distraught over his missing cart. He doesn't seem to be aligned with Ranrok's Loyalists. Perhaps I should investigate.Talk to the goblin outside Lower HogsfieldRewards: Appearances Quest name: Crossed Wands: Round 1[45] Location: Clock Tower Notes: I should speak with Lucan Brattleby about the secret duelling club.Talk to Lucan Brattleby Quest name: Crossed Wands: Round 2[46] Location: Clock Tower Notes: I should check in with Lucan Brattleby and see if another round of Crossed Wands is available.Talk to Lucan Brattleby Quest name: Crossed Wands: Round 3[47] Location: Clock Tower Notes: The"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk4",
    "text": "Brattleby about the secret duelling club.Talk to Lucan Brattleby Quest name: Crossed Wands: Round 2[46] Location: Clock Tower Notes: I should check in with Lucan Brattleby and see if another round of Crossed Wands is available.Talk to Lucan Brattleby Quest name: Crossed Wands: Round 3[47] Location: Clock Tower Notes: The final round of duelling is available at Crossed Wands. It will determine the champion of the school. I should see Lucan Brattleby.Talk to Lucan BrattlebyRewards: Appearances Quest name: TheDaedalian Keys[48] Location: Astronomy Wing Notes: Nellie Oggspire is in the Transfiguration Courtyard and seems elated about something. I’m interested to learn what’s so exciting.Speak with Nellie OggspireRewards: Relic House Uniform Quest name: A Demanding Delivery Location: Hogsmeade Notes: Parry Pippin of J. Pippin's Potions in Hogsmeade sent me an owl regarding a delivery. I should speak with him if I'm looking for some simple work.Speak with Parry PippinRewards: Appearances, Gold Quest name: 'Dissending' for Sweets Location: The Great Hall Notes: It appears thatGarreth Weasleywants to speak with me.Talk to Garreth WeasleyRewards: Gold, Conjuration Spellcraft Quest name: Flight Test[49] Location: Hogsmeade Notes: After completing my broom flight training in Madam Kogawa's Flying class, Everett mentioned checking in with Albie Weekes at Sprintwitches to get a broom.Purchase a broom at SpintwitchesI purchased abroomfrom Mr Weekes and he advised I speak with Imelda Reyes at theQuidditch Pitch. She's running timed trials which are sure to be the perfectflighttests.Speak with Imelda Reyes at the Quidditch PitchPlace in the Quidditch pitch Broom TrialReport back to ImeldaReturn to Albie Weekes Quest name: Follow theButterflies Location: Hogsmeade Notes: I overheardClementine Willardseytalking to herself in the Three Broomsticks. She mentioned something about a swarm of butterflies.Talk to Clementine WillardseyRewards:ConjurationSpellcraft Quest name: A Friend in Deed Location: Notes: Quest name: Foal of the Dead Location: Notes: Quest name: Ghostof OurLove[50] Location: Owlery Notes: The map portrays a forest, bridge and candles. I've put it into my bag for reference.Use the Map with Floating Candles to find the treasure Quest name: Gobs ofGobstones Location: Defence Against the Dark Arts Tower Notes: *Find Zenobia's Gobstones (0/6) Quest name: Like a Moth to a Frame[51] Location: Central Hall Notes: Lenora mentioned that the painting revealed a clue when she cast Lumos near it. Perhaps I should try that myself.Discover the painting's secretRewards: Appearances Quest name: The LostAstrolabe Location: Black Lake Notes: Astudentoutside Lower Hogsfield is staring longingly out over the waters ofBlack Lake. I wonder what's on her mind.Speak with the student on the dockRewards: Appearances Quest name: The Lost Child[52] Location: Notes: Quest name: The Man Behind the Moons[53] Location: The South Wing Notes: Mr Moon will teach me a more advanced form of Alohomora once I find all the Demiguise statues. I should search Hogwarts, Hogsmeade and many hamlets for the statues. I can only collect, the moons from the statues at night.Speak with Gladwin MoonRewards: Alohomora II & Alohomora III Quest name: Spell Combination Practice 1[54] Location: Clock Tower Notes: I should see about starting a training regimen for practicing"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk5",
    "text": "I should search Hogwarts, Hogsmeade and many hamlets for the statues. I can only collect, the moons from the statues at night.Speak with Gladwin MoonRewards: Alohomora II & Alohomora III Quest name: Spell Combination Practice 1[54] Location: Clock Tower Notes: I should see about starting a training regimen for practicing spell combinations.Talk to Lucan Brattleby Quest name: Spell Combination Practice 2[55] Location: Clock Tower Notes: The Crossed Wands club meets regularly in the Clock Tower. I should be able to find Lucan Brattleby there.Talk to Lucan Brattleby Quest name: Sweeping the Competition Location: Hogsmeade Notes: Look into a new broom enhancement with Albie Weeks in Spintwitches Sporting Needs.Purchase a broom enhancement from Albie Weekes Quest name: The Tale ofRowland Oakes[56] Location: Notes: Adelaide Oakesseems worried about someone. I should speak with her.Talk with Adelaide OakesRowland's map depicts a few key landmarks. Perhaps I can use them to help me work out where the goblins have taken him.Use Rowland's map to follow his trailRequirements: 10 - Suggested LevelRewards: Appearances Quest name: A Thief in the Night Location: Notes: Quest name: Trials of Merlin Location: Notes: Quest name: Venomous Valour Location: Notes: Picture: Achievement/Trophy Name: A Forte for Achievement Description: Complete the introduction and finish the Sorting Ceremony Picture: Achievement/Trophy Name: A Keen Sense of Spell Description: Invoke Ancient Magic for the first time Picture: Achievement/Trophy Name: A Sallow Grave Description: Complete Sebastian Sallow's relationship line Picture: Achievement/Trophy Name: A Talent for Spending Description: Spend 5 Talent points Picture: Achievement/Trophy Name: Beast Friends Description: Complete Poppy Sweeting's relationship line Picture: Achievement/Trophy Name: Challenge Accepted Description: Complete all tiers of a challenge Picture: Achievement/Trophy Name: Coasting Along Description: Visit Poidsear Coast Picture: Achievement/Trophy Name: Collector's Edition Description: Complete all collections Picture: Achievement/Trophy Name: Demiguise Dread Description: Find all Demiguise statues Picture: Achievement/Trophy Name: Finishing Touches Description: Use Ancient Magic on every enemy in the game Picture: Achievement/Trophy Name: First Class Student Description: Attend your first class Picture: Achievement/Trophy Name: Flight the Good Flight Description: Beat Imelda's time in all broom races Picture: Achievement/Trophy Name: Floo Around the World Description: Unlock all Floo Flames Picture: Achievement/Trophy Name: Followed the Butterflies Description: Follow butterflies to a treasure Picture: Achievement/Trophy Name: Going Through the Potions Description: Brew every type of potion Picture: Achievement/Trophy Name: Grappling with a Graphorn Description: Subdue the Lord of the Shore Picture: Achievement/Trophy Name: Loom for Improvement Description: Upgrade a piece of gear Picture: Achievement/Trophy Name: Merlin's Beard! Description: Complete all Merlin Trials Picture: Achievement/Trophy Name: Put Down Roots Description: Grow every type of plant Picture: Achievement/Trophy Name: Raising Expectations Description: Reach a combo of 100 Picture: Achievement/Trophy Name: Rise to the Challenges Description: Defeat enemies in all battle arenas Picture: Achievement/Trophy Name: Rising From the Ashes Description: Rescue the phoenix Picture: Achievement/Trophy Name: Room with a View Description: Reach the highest point in the castle, the Headmaster's upper study Picture: Achievement/Trophy Name: Savvy Spender Description: Spend all Talent Points Picture: Achievement/Trophy Name: Spilled Milk Description: Use Flipendo ten times – to"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk6",
    "text": "Name: Rising From the Ashes Description: Rescue the phoenix Picture: Achievement/Trophy Name: Room with a View Description: Reach the highest point in the castle, the Headmaster's upper study Picture: Achievement/Trophy Name: Savvy Spender Description: Spend all Talent Points Picture: Achievement/Trophy Name: Spilled Milk Description: Use Flipendo ten times – to tip one cow or several Picture: Achievement/Trophy Name: That's a Keeper Description: Meet Charles Rookwood in the Map Chamber Picture: Achievement/Trophy Name: The Auror's Apprentice Description: Find the Map Chamber as a Hufflepuff Picture: Achievement/Trophy Name: The Avenging Gazelle Description: Complete Natsai Onai's relationship line Picture: Achievement/Trophy Name: The Defender of Dragons Description: Save a dragon Picture: Achievement/Trophy Name: The Ends Petrify the Means Description: Defeat a total of fifty enemies using Petrificus Totalus Picture: Achievement/Trophy Name: The Good Samaritan Description: Complete all side quests Picture: Achievement/Trophy Name: The Gryffindor in the Graveyard Description: Find the Map Chamber as a Gryffindor Picture: Achievement/Trophy Name: The Hallowed Hero Description: Wield a Deathly Hallow Picture: Achievement/Trophy Name: The Hero of Hogwarts Description: Defeat Ranrok Picture: Achievement/Trophy Name: The Intrepid Explorer Description: Discover all cairn dungeons Picture: Achievement/Trophy Name: The Nature of the Beast Description: Breed every type of beast Picture: Achievement/Trophy Name: The One Who Mastered Memories Description: View all Pensieve memories Picture: Achievement/Trophy Name: The Root of the Problem Description: Stun 10 different enemies using a Mandrake Picture: Achievement/Trophy Name: The Seeker of Knowledge Description: Win the House Cup Picture: Achievement/Trophy Name: The Sort Who Makes An Entrance Description: Complete the introduction and finish the Sorting Ceremony Picture: Achievement/Trophy Name: The Spell Master Description: Learn all spells Picture: Achievement/Trophy Name: The Toast of the Town Description: Find the Map Chamber as a Slytherin Picture: Achievement/Trophy Name: The Wise Owl Description: Find the Map Chamber as a Ravenclaw Picture: Achievement/Trophy Name: Third Time's a Charm Description: Upgrade a piece of gear 3 times Picture: Achievement/Trophy Name: Troll with the Punches Description: Survive the troll attack on Hogsmeade At least some content in this article is derived from information featured in: Harry Potter: Hogwarts Mystery & Hogwarts Legacy.As such, spoilers will be present within the article. Hogwarts Legacy Video game information Developer Avalanche Software Publisher Portkey Games Released 10 February 2023 (PlayStation 5, Xbox Series X|S, PC)[1]5 May 2023 (PlayStation 4, Xbox One)[2]14 November 2023 (Nintendo Switch)[3] Genre Open-world role-playing game Platforms PlayStation 4[4]PlayStation 5[4]Xbox One[4]Xbox Series X|S[4]PC[4]Nintendo Switch[4] Followed by Hogwarts Legacy 2 [Source] 10 February 2023 (PlayStation 5, Xbox Series X|S, PC)[1] 5 May 2023 (PlayStation 4, Xbox One)[2] 14 November 2023 (Nintendo Switch)[3] PlayStation 4[4] PlayStation 5[4] Xbox One[4] Xbox Series X|S[4] PC[4] Nintendo Switch[4] Hogwarts Legacy is an open-world action role-playing game set in the late 19th century within the wizarding world. Developed by Avalanche Software and published by Warner Bros. Interactive Entertainment under the Portkey Games label, the game was released on 10 February 2023 on PC, PlayStation 5, and Xbox Series X|S.[4] It was originally going to be released on 4 April 2023 on PlayStation 4 and"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk7",
    "text": "the wizarding world. Developed by Avalanche Software and published by Warner Bros. Interactive Entertainment under the Portkey Games label, the game was released on 10 February 2023 on PC, PlayStation 5, and Xbox Series X|S.[4] It was originally going to be released on 4 April 2023 on PlayStation 4 and Xbox One, but the release date was changed to 5 May 2023.[2] It was released on the Nintendo Switch on 14 November 2023.[3] 1 Plot 2 Development 3 Gameplay 4 Characters 4.1 Hogwarts students 4.1.1 Unknown House 4.1.2 Gryffindor 4.1.3 Hufflepuff 4.1.4 Ravenclaw 4.1.5 Slytherin 4.2 Hogwarts staff 4.3 Historical wizards 4.3.1 Keepers 4.3.2 Others 4.4 Hogsmeade villagers 4.5 Rookwood Gang 4.6 Others 4.1 Hogwarts students 4.1.1 Unknown House 4.1.2 Gryffindor 4.1.3 Hufflepuff 4.1.4 Ravenclaw 4.1.5 Slytherin 4.1.1 Unknown House 4.1.2 Gryffindor 4.1.3 Hufflepuff 4.1.4 Ravenclaw 4.1.5 Slytherin 4.2 Hogwarts staff 4.3 Historical wizards 4.3.1 Keepers 4.3.2 Others 4.3.1 Keepers 4.3.2 Others 4.4 Hogsmeade villagers 4.5 Rookwood Gang 4.6 Others 5 Locations 5.1 World map 5.1 World map 6 Spells 6.1 Essential 6.2 Selectable 6.3 Others 6.1 Essential 6.2 Selectable 6.3 Others 7 Potions 8 Creatures 9 Quests 9.1 Main Quests 9.2 Assignments 9.3 Relationship Quests 9.4 Side Quests 9.1 Main Quests 9.2 Assignments 9.3 Relationship Quests 9.4 Side Quests 10 Media gallery 10.1 Promotional 10.2 Trailers 10.3 Soundtrack 10.4 Other 10.1 Promotional 10.2 Trailers 10.3 Soundtrack 10.4 Other 11 Achievements/Trophies 12 Behind the scenes 13 Notes and references 14 See also 15 External links Players create a character capable of seeing and harnessing ancient magic who begins attending Hogwarts School of Witchcraft and Wizardry as a fifth-year student in the 1890s. During the gameplay reveal trailer in March 2022, a newspaper can be seen dated 1 September 1890. Players experience the life of the student as they \"live the unwritten\" and embark on a dangerous journey to uncover a hidden truth of the wizarding world. Besides the protagonist, there are companion students such as Natsai Onai, a brave and justice-seeking Gryffindor, Poppy Sweeting, a kind and beast-loving Hufflepuff, and Sebastian Sallow, a charismatic and optimistic Slytherin. Villains include Ranrok (a goblin staging a rebellion against wizardkind) and Victor Rookwood (a Dark wizard operating in and around Hogsmeade). The game was originally leaked on Reddit in October 2018 alongside a now-deleted unofficial trailer that showed extensive character creation, spell-casting, magical creatures, and exploration. No official comment was given by either Warner Bros. nor J. K. Rowling, although many reputable sources inside WB Avalanche, including high ranking employees, teased or claimed to know of the game.[5][6][7][8] The game was announced via a video game showcase stream by Sony on 16 September 2020.[9] It was set to be available to players in 2021, but the date was later delayed twice, first to 2022, then to 10 February 2023 to continue developing the game for a better experience for players.[1] On 17 March 2022, PlayStation revealed a State of Play presentation that featured 20 minutes of gameplay and behind the scenes content.[10][11] Community"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk8",
    "text": "2021, but the date was later delayed twice, first to 2022, then to 10 February 2023 to continue developing the game for a better experience for players.[1] On 17 March 2022, PlayStation revealed a State of Play presentation that featured 20 minutes of gameplay and behind the scenes content.[10][11] Community manager Chandler Wood revealed that the game will not have any microtransactions.[12] On 18 May 2022, Avalanche released an ASMR video showing some additional footage of the Hogwarts grounds, Hogsmeade, and an unidentified area which included a store called the Magic Neep. While it did not include any additional story information, it did confirm several locations including Zonkos, Dervish and Banges, and Steeply and Sons tea shop. On 24 May 2022, PlayStation revealed that PS5 will have exclusives relating to the Dual Sense controllers.[13] The game had started development with actors portraying characters in the games. Actors were cast and were scheduled to start when the COVID-19 pandemic occurred. As a result, actors were forced to stay at home. The cast were forced to use the company Beyond Capture in Vancouver and employ Canadian actors. They used actors who were able to perform multiple actors; Direction and communication via Zoom.[14] On 12 August 2022, the official release date was revealed to be 10 February 2023 for PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series S and Xbox Series X. The Switch version would be ported later on.[15] A new exclusive trailer was unveiled at Gamescon on 23 August 2022, with a pre-order date on 25 August.[16] A Digital Deluxe version was revealed in the same trailer, with a collector's edition revealed on 24 August.[17] On 13 December 2022, Avalanche delayed the game for Xbox One and PlayStation 4 until 4 April 2023.[18][19] On 6 March, the game on Xbox One and Playstation 4 was delayed from 4 April to 5 May.[2] Gameplay includes detailed character creation, spell-casting, exploration, stealth, and elements of both the action and role-playing genres. As it is common for non-free console and PC games, no system of microtransactions is used, unlike the similar mobile game Harry Potter: Hogwarts Mystery.[12][20] The player is able to develop their own duelling style by combining different spells. They are also able to make specific allies; it is possible to become a Dark wizard or witch instead of following a hero path, though the ending will still be the same as the protagonist is lauded as a hero for saving Hogwarts.[20] The game is set in the Scottish Highlands, including Hogwarts and a vast territory around it. Broom flight can be used to reach farther locations, which includes wizard villages such as Hogsmeade. The developers have also confirmed a fast-travel system known as \"Floo Flames\". The scenery and other environments are highly detailed and intricate, weather events affect the environment, and the four climatic seasons are reflected in the landscape.[20] A Wizard's Field Guide is provided to the player which keeps track of their level. It also includes their map,"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk9",
    "text": "system known as \"Floo Flames\". The scenery and other environments are highly detailed and intricate, weather events affect the environment, and the four climatic seasons are reflected in the landscape.[20] A Wizard's Field Guide is provided to the player which keeps track of their level. It also includes their map, quests, owl post, settings, challenges, collections, talents (which unlocks through the main story), inventory and gear. Unidentified student Isaac Cooper Arthur Siggs[21] Ruby Wiel Lottie Fernsby Ezra Quintrell Elsie Morgan Cressida Blume Eric Northcott Garreth Weasley Hector Jenkins Lawrence Davies Leander Prewett Lucan Brattleby Natsai Onai Nellie Oggspire Adelaide Oakes Arthur Plummly Benny Stokes Charlotte Morrison Evangeline Bardsley Lenora Everleigh Poppy Sweeting Sacharissa Tugwood Amit Thakkar Andrew Larson Astoria Crickett Constance Dagworth Duncan Hobhouse Everett Clopton Gertrude Wigley Hector Fawley Mahendra Pehlwaan Samantha Dale Sophronia Franklin Zenobia Noke Anne Sallow Grace Pinch-Smedley Imelda Reyes Nerida Roberts Ominis Gaunt Priscilla Wakefield Sebastian Sallow Violet McDowell Phineas Nigellus Black, Professor, Headmaster Matilda Weasley, Professor, Transfiguration and Deputy Headmistress Eleazar Fig, Professor, Magical Theory Aesop Sharp, Professor, Potions Dinah Hecat, Professor, Defence Against the Dark Arts Mirabel Garlick, Professor, Herbology Abraham Ronen, Professor, Charms Cuthbert Binns, Professor, History of Magic Bai Howin, Professor, Beasts Chiyo Kogawa, Professor, Flying Mudiwa Onai, Professor, Divination Satyavati Shah, Professor, Astronomy Noreen Blainey, matron Agnes Scribner, librarian Gladwin Moon, caretaker San Bakar Niamh Fitzgerald Percival Rackham Charles Rookwood Baruffio Noctua Gaunt Apollonia Black Artemisia Blackwood Eunon Blackwood Lysandra Blackwood Bragbor the Boastful Herodiana Byrne Illyius Isidora Morganach Richard Jackdaw Lachlan the Lanky Merlin Anne Thisbe Salazar Slytherin Thomas Brown Beatrice Green Augustus Hill Cassandra Mason Gerbold Ollivander Sirona Ryan Ellie Peck Parry Pippin Calliope Snelling Timothy Teasdale Thaddeus Travers Jasper Trout Albie Weekes Lottie Featherbottom Ackley Barnes Catrin Haggarty Theophilus Harlow Iona Morgan Victor Rookwood Silvanus Selwyn Tempeste Thorne Ailsa Travers Gwendolyn Zhou Arn Leopold Babcocke Bardolph Beaumont Claire Beaumont Archie Bickle Johanna Bickle Biscuit The Bloody Baron Effie Bones Lethia Burbley Heath Heatherton Death Caligo Agnes Coffey Deek Otto Dibble Dorran Crispin Dunne Elek Fastidio The Fat Friar The Fat Lady Feenky Miriam Fig Garnuff Gerald Gwyneira Pádraic Haggarty Cillian Hawksworth Hazel The Grey Lady Rosie Hill Highwing Ernie Lark Fatimah Lawang Lodgok Bella Navarro Bernard Ndiaye The Lord of the Shore Nearly Headless Nick Hyacinth Olivier George Osric Rowland Oakes Peeves Piers Pemberton Penny Persephone Agabus Philbert Dulcibella Philbert Rohan Prakash Mary Portman Daisy Rabe Isko Rabe Ranrok Alexandra Ricketts Rococo Sepulchria Solomon Sallow Scrope Ruth Singer Jalal Sehmi Wigot Spitchwick Dorothy Sprottle Perdita Strix Eddie Thistlewood Helen Thistlewood Nora Treadwell Priya Treadwell Ethel Wigley Clementine Willardsey Ogle Diagon Alley Gringotts Wizarding Bank Vault 12 Gringotts Wizarding Bank Vault 12 Vault 12 Hogsmeade Valley East Hogsmeade Valley Falbarton Castle Hogsmeade Dervish and Banges Hog's Head Inn Hogsmeade Station The Magic Neep Ollivanders Post Office Quality Quidditch Supplies Steepley and Sons Three Broomsticks Inn Zonko's Joke Shop Tomes and Scrolls The Haunted Hogsmeade Shop East Hogsmeade Valley Falbarton Castle Hogsmeade Dervish and Banges Hog's Head Inn Hogsmeade"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk10",
    "text": "Valley Falbarton Castle Hogsmeade Dervish and Banges Hog's Head Inn Hogsmeade Station The Magic Neep Ollivanders Post Office Quality Quidditch Supplies Steepley and Sons Three Broomsticks Inn Zonko's Joke Shop Tomes and Scrolls The Haunted Hogsmeade Shop East Hogsmeade Valley Falbarton Castle Hogsmeade Dervish and Banges Hog's Head Inn Hogsmeade Station The Magic Neep Ollivanders Post Office Quality Quidditch Supplies Steepley and Sons Three Broomsticks Inn Zonko's Joke Shop Tomes and Scrolls The Haunted Hogsmeade Shop Dervish and Banges Hog's Head Inn Hogsmeade Station The Magic Neep Ollivanders Post Office Quality Quidditch Supplies Steepley and Sons Three Broomsticks Inn Zonko's Joke Shop Tomes and Scrolls The Haunted Hogsmeade Shop Hogwarts Castle The Great Hall Hogwarts Library Restricted Section Athenaeum A History of Magic Classroom A Potions Classroom The Astronomy Wing The Astronomy Tower Hogwarts Turris Magnus One-Eyed Witch Passage A Charms Classroom A Defence Against the Dark Arts Classroom Eleazar Fig's office The Bell Tower Wing Bell Towers The Fat Lady's Corridor Gryffindor Tower The Gryffindor common room The Gryffindor Boys' Dormitory The Gryffindor Girls' Dormitory The Hogwarts kitchens Kitchen corridor Hufflepuff Basement The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory Ravenclaw Tower staircase Ravenclaw Tower The Ravenclaw common room The Ravenclaw Boys' Dormitory The Ravenclaw Girls' Dormitory Ravenclaw Tower roof terrace Dungeons Slytherin Dungeon The Slytherin common room The Slytherin Boys' Dormitory The Slytherin Girls' Dormitory Slytherin's Scriptorium The Owlery Tower The Owlery The Headmaster's office Matilda Weasley's office A Herbology Classroom The Prefects' Bathroom The Room of Requirement The Viaduct Courtyard The Central Hall The Transfiguration Courtyard The Transfiguration Classroom The Library Annex The Clock Tower Courtyard The Clock Tower The Hall of Herodiana The Hesperius Hall The Hospital Wing The Gamekeeper's Hut The Faculty Tower The Detention Chamber The Undercroft Triptych The Greenhouses Summoner's Court Hidden doors The Great Hall Hogwarts Library Restricted Section Athenaeum Restricted Section Athenaeum Athenaeum A History of Magic Classroom A Potions Classroom The Astronomy Wing The Astronomy Tower Hogwarts Turris Magnus One-Eyed Witch Passage A Charms Classroom A Defence Against the Dark Arts Classroom Eleazar Fig's office The Astronomy Tower Hogwarts Turris Magnus One-Eyed Witch Passage One-Eyed Witch Passage A Charms Classroom A Defence Against the Dark Arts Classroom Eleazar Fig's office The Bell Tower Wing Bell Towers Bell Towers The Fat Lady's Corridor Gryffindor Tower The Gryffindor common room The Gryffindor Boys' Dormitory The Gryffindor Girls' Dormitory Gryffindor Tower The Gryffindor common room The Gryffindor Boys' Dormitory The Gryffindor Girls' Dormitory The Gryffindor common room The Gryffindor Boys' Dormitory The Gryffindor Girls' Dormitory The Gryffindor Boys' Dormitory The Gryffindor Girls' Dormitory The Hogwarts kitchens Kitchen corridor Hufflepuff Basement The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory Kitchen corridor Hufflepuff Basement The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory Hufflepuff Basement The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory The Hufflepuff Boys' Dormitory The"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk11",
    "text": "Hufflepuff Girls' Dormitory Kitchen corridor Hufflepuff Basement The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory Hufflepuff Basement The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory The Hufflepuff common room The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory The Hufflepuff Boys' Dormitory The Hufflepuff Girls' Dormitory Ravenclaw Tower staircase Ravenclaw Tower The Ravenclaw common room The Ravenclaw Boys' Dormitory The Ravenclaw Girls' Dormitory Ravenclaw Tower roof terrace Ravenclaw Tower The Ravenclaw common room The Ravenclaw Boys' Dormitory The Ravenclaw Girls' Dormitory The Ravenclaw common room The Ravenclaw Boys' Dormitory The Ravenclaw Girls' Dormitory The Ravenclaw Boys' Dormitory The Ravenclaw Girls' Dormitory Ravenclaw Tower roof terrace Dungeons Slytherin Dungeon The Slytherin common room The Slytherin Boys' Dormitory The Slytherin Girls' Dormitory Slytherin's Scriptorium Slytherin Dungeon The Slytherin common room The Slytherin Boys' Dormitory The Slytherin Girls' Dormitory The Slytherin common room The Slytherin Boys' Dormitory The Slytherin Girls' Dormitory The Slytherin Boys' Dormitory The Slytherin Girls' Dormitory Slytherin's Scriptorium The Owlery Tower The Owlery The Headmaster's office The Owlery The Headmaster's office Matilda Weasley's office A Herbology Classroom The Prefects' Bathroom The Room of Requirement The Viaduct Courtyard The Central Hall The Transfiguration Courtyard The Transfiguration Classroom The Library Annex The Clock Tower Courtyard The Clock Tower The Clock Tower The Hall of Herodiana The Hesperius Hall The Hospital Wing The Gamekeeper's Hut The Faculty Tower The Detention Chamber The Undercroft Triptych Triptych The Greenhouses Summoner's Court Hidden doors Highlands Percival Rackham's old home Horntail Hall Pitt-upon-Ford Upper Hogsfield Marunweem Bainburgh Cragcroft Clagmar Coast Percival Rackham's old home Horntail Hall Pitt-upon-Ford Upper Hogsfield Marunweem Bainburgh Cragcroft Clagmar Coast Hogwarts Valley Brocburrow Keenbridge Brocburrow Keenbridge North Hogwarts Region Forbidden Forest Jackdaw's Tomb Map Chamber Keepers' Caverns Final repository Korrow Ruins Forbidden Forest Jackdaw's Tomb Map Chamber Keepers' Caverns Final repository Jackdaw's Tomb Map Chamber Keepers' Caverns Final repository Map Chamber Keepers' Caverns Final repository Keepers' Caverns Final repository Final repository Korrow Ruins South Hogwarts Region Aranshire Hogwarts Quidditch pitch Lower Hogsfield Aranshire Hogwarts Quidditch pitch Lower Hogsfield Feldcroft Region Feldcroft Irondale Rookwood Castle Rookwood Castle repository Isidora Morganach's house Feldcroft Irondale Rookwood Castle Rookwood Castle repository Rookwood Castle repository Isidora Morganach's house Azkaban Basic Cast Full Body-Bind Curse (Petrificus Totalus) General Counter-Spell (Finite) Revelio Charm (Revelio) Shield Charm (Protego) Stunning Spell (Stupefy) Unidentified ancient magic finishers Unidentified ancient magic throw Unidentified potion-making spell Unlocking Charm (Alohomora) Altering Spell Banishing Charm (Depulso) Blasting Curse (Confringo) Bombardment Spell (Bombarda) Conjuring Spell Cruciatus Curse (Crucio) Descendo Disarming Charm (Expelliarmus) Disillusionment Charm Freezing Spell (Glacius) Fire-Making Spell (Incendio) Imperius Curse (Imperio) Killing Curse (Avada Kedavra) Knockback Jinx (Flipendo) Levitation Charm (Wingardium Leviosa) Levitation Spell (Levioso) Mending Charm (Reparo) Severing Charm (Diffindo) Slowing Charm (Arresto Momentum) Summoning Charm (Accio) Transformation Spell Vanishing Spell (Evanesco) Wand-Lighting Charm (Lumos) Apparition Expulso Curse (Expulso) One-Eyed Witch Spell (Dissendium) Reductor Curse (Reducto) Edurus Potion Felix Felicis Focus Potion Invisibility Potion Maxima Potion Thunderbrew Wiggenweld Potion Beasts Augurey Basilisk (mentioned only) Billywig (mentioned only) Bowtruckle"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk12",
    "text": "Charm (Diffindo) Slowing Charm (Arresto Momentum) Summoning Charm (Accio) Transformation Spell Vanishing Spell (Evanesco) Wand-Lighting Charm (Lumos) Apparition Expulso Curse (Expulso) One-Eyed Witch Spell (Dissendium) Reductor Curse (Reducto) Edurus Potion Felix Felicis Focus Potion Invisibility Potion Maxima Potion Thunderbrew Wiggenweld Potion Beasts Augurey Basilisk (mentioned only) Billywig (mentioned only) Bowtruckle (mentioned only) Centaur Cockatrice (tapestry only) Dark Mongrel Death's Dark Mongrel Demiguise (mentioned only) Diricawl Dragons Antipodean Opaleye (mentioned only) Common Welsh Green Hebridean Black Hungarian Horntail Peruvian Vipertooth (mentioned only) Ukrainian Ironbelly (mentioned only) Dugbog Erumpent (chalkboard drawing only) Fire Crab (mentioned only) Fwooper Giant Purple Toad Giant Squid Ghoul (mentioned only) Glumbumble Gnome (mentioned only) Golden Snidget Gorgon (portrait only) Graphorn Griffin (statue and tapestry only) Grim Grindylow (mentioned only) Hidebehind (mentioned only) Hippocampus (mosaic and drawing only) Hippogriff Jobberknoll Kelpie (mentioned only) Kneazle Lethifold (mentioned only) Mackled Malaclaw (mentioned only) Merperson (mentioned only) Mooncalf Murtlap (mentioned only) Niffler Nogtail (mentioned only) Occamy (mentioned only) Phoenix Puffskein Runespoor (mentioned only) Snallygaster (mentioned only) Spiders Acromantula Thornback Three-headed dog (tapestry only) Trolls Forest Troll Mountain troll River troll Death's Troll Unicorn Wampus cat (mentioned only) Werewolf (mentioned only) Winged horse Granian (mentioned only) Thestral Wyvern (statue only) Augurey Basilisk (mentioned only) Billywig (mentioned only) Bowtruckle (mentioned only) Centaur Cockatrice (tapestry only) Dark Mongrel Death's Dark Mongrel Death's Dark Mongrel Demiguise (mentioned only) Diricawl Dragons Antipodean Opaleye (mentioned only) Common Welsh Green Hebridean Black Hungarian Horntail Peruvian Vipertooth (mentioned only) Ukrainian Ironbelly (mentioned only) Antipodean Opaleye (mentioned only) Common Welsh Green Hebridean Black Hungarian Horntail Peruvian Vipertooth (mentioned only) Ukrainian Ironbelly (mentioned only) Dugbog Erumpent (chalkboard drawing only) Fire Crab (mentioned only) Fwooper Giant Purple Toad Giant Squid Ghoul (mentioned only) Glumbumble Gnome (mentioned only) Golden Snidget Gorgon (portrait only) Graphorn Griffin (statue and tapestry only) Grim Grindylow (mentioned only) Hidebehind (mentioned only) Hippocampus (mosaic and drawing only) Hippogriff Jobberknoll Kelpie (mentioned only) Kneazle Lethifold (mentioned only) Mackled Malaclaw (mentioned only) Merperson (mentioned only) Mooncalf Murtlap (mentioned only) Niffler Nogtail (mentioned only) Occamy (mentioned only) Phoenix Puffskein Runespoor (mentioned only) Snallygaster (mentioned only) Spiders Acromantula Thornback Acromantula Thornback Three-headed dog (tapestry only) Trolls Forest Troll Mountain troll River troll Death's Troll Forest Troll Mountain troll River troll Death's Troll Unicorn Wampus cat (mentioned only) Werewolf (mentioned only) Winged horse Granian (mentioned only) Thestral Granian (mentioned only) Thestral Wyvern (statue only) Beings Goblin House-elf Goblin House-elf Spirits Boggart Dementor Ghost Poltergeist Boggart Dementor Ghost Poltergeist Inferius Animals Bat Bee Beetle Bird American kestrel Chicken (animal) Crow Golden eagle Grouse Nightingale Owl Plover (concept only) Seagull Butterfly Cat Cattle Highland cattle Crab (concept only) Deer Dog (tapestry and mentioned only) Dragonfly Elephant (drawing and painting only) Firefly Fish Barbel Haddock Puffer-fish (in a jar) Ray (stuffed) Lacewing fly Leech Leopard (tapestry only) Moth Rabbit Rat Rhinoceros (skeleton) Sabre-toothed tiger (skeleton) Sheep Spider Toad Whale (drawing only) Weasel (tapestry only) Wolf Bat Bee Beetle Bird American kestrel Chicken (animal) Crow Golden eagle Grouse Nightingale Owl Plover (concept only) Seagull American kestrel Chicken (animal)"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk13",
    "text": "a jar) Ray (stuffed) Lacewing fly Leech Leopard (tapestry only) Moth Rabbit Rat Rhinoceros (skeleton) Sabre-toothed tiger (skeleton) Sheep Spider Toad Whale (drawing only) Weasel (tapestry only) Wolf Bat Bee Beetle Bird American kestrel Chicken (animal) Crow Golden eagle Grouse Nightingale Owl Plover (concept only) Seagull American kestrel Chicken (animal) Crow Golden eagle Grouse Nightingale Owl Plover (concept only) Seagull Butterfly Cat Cattle Highland cattle Highland cattle Crab (concept only) Deer Dog (tapestry and mentioned only) Dragonfly Elephant (drawing and painting only) Firefly Fish Barbel Haddock Puffer-fish (in a jar) Ray (stuffed) Barbel Haddock Puffer-fish (in a jar) Ray (stuffed) Lacewing fly Leech Leopard (tapestry only) Moth Rabbit Rat Rhinoceros (skeleton) Sabre-toothed tiger (skeleton) Sheep Spider Toad Whale (drawing only) Weasel (tapestry only) Wolf Explore the ruins This castle is enormous! I may need to use the Charmed Compass in the Field Guide to help me find the way. Go to Charms class Rewards:Accio I could get lost in this castle. I may need to use the Charmed compass in the Field Guide to help me find the way. Attend Defence Against the Dark Arts Class Rewards: Levioso Meet Professor Weasley in the Transfiguration classroom Requirements: 2 - Required Level Meet Natty near the entrance to Hogwarts Requirements: 2 - Required Level, Reparo Rewards: Ancient Magic Throw, Ancient Magic Rewards: Disillusionment The Girl from Uagadou[31] Meet Natty Onai in Lower Hogsfield Requirements: 4 - Required Level Go to Herbology class Requirements: 3 - Required Level Attend Potions Class Requirements: 4 - Required Level Visit Mr Ollivander in Hogsmeade Requirements: 5 - Required Level Speak to Nearly Headless Nick Requirements: 5 - Required Level Meet Richard Jackdaw at the Forbidden Forest Follow Jackdaw through the Forbidden Forest Find the cave where Richard Jackdaw died Whisper the password Investigate the cave where Jackdaw died Defeat Ranrok's Loyalists Find the missing pages Defend yourself against the Ancient Defenders Investigate the traces of ancient magic Exit the Map Chamber Requirements: Expelliarmus Go to Flying class Fly through the rings (0/3) Fly through the rings around the grounds Follow Everett Clopton Return to the Courtyard Land and dismount Requirements: 6 - Required Level Meet Sebastian Requirements: 8 - Required Level Rewards: Confringo Meet with Professor Weasley Requirements: 6 - Required Level Rewards: Conjuring Spell, Evanesco, Conjuration Spellcraft Go to Beasts class Requirements: 13 - Required Level The Caretaker's Lunar Lament Talk to Gladwin Moon Rewards: Alohomora Speak to Sirona in the Three Broomsticks Requirements: 12 - Required Level, Depulso Pop balloons over Hogsmeade Station (0/5) Pop balloons around the Quidditch Pitch (0/5) Rewards: Glacius Acquire and use a Venomous Tentacula Acquire and use a Mandrake on multiple enemies simultaneously Rewards: Wingardium Leviosa Report to Professor Hecat Win two rounds of Crossed Wands[41] Complete a round of spell combination practice with Lucan Brattleby[41] Win two rounds of Crossed Wands[41] Complete a round of spell combination practice with Lucan Brattleby[41] Return to Professor Hecat Rewards: Incendio Successfully avoid enemy attacks by dodge rolling (0/10) Cast Incendio on"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk14",
    "text": "Hecat Win two rounds of Crossed Wands[41] Complete a round of spell combination practice with Lucan Brattleby[41] Win two rounds of Crossed Wands[41] Complete a round of spell combination practice with Lucan Brattleby[41] Return to Professor Hecat Rewards: Incendio Successfully avoid enemy attacks by dodge rolling (0/10) Cast Incendio on enemies (0/5) Rewards: Expelliarmus Collect Troll Bogeys (0/1) Cast Depulso on a levitated enemy Rewards: Descendo Report to Professor Ronen Collect the flying page near the broken statue Collect the flying page in the Defence Against the Dark Arts Tower Collect the flying page near the broken statue Collect the flying page in the Defence Against the Dark Arts Tower Rewards: Reparo Acquire and use a Focus Potion Acquire Maxima and Edurus Potions, and use them simultaneously Rewards: Depulso Speak with Sebastian in the Undercroft Find the first landmark from Arthur's Treasure Map Talk to the goblin outside Lower Hogsfield Rewards: Appearances Talk to Lucan Brattleby Talk to Lucan Brattleby Talk to Lucan Brattleby Rewards: Appearances The Daedalian Keys[48] Speak with Nellie Oggspire Rewards: Relic House Uniform Speak with Parry Pippin Rewards: Appearances, Gold Talk to Garreth Weasley Rewards: Gold, Conjuration Spellcraft Purchase a broom at Spintwitches I purchased a broom from Mr Weekes and he advised I speak with Imelda Reyes at the Quidditch Pitch. She's running timed trials which are sure to be the perfect flight tests. Speak with Imelda Reyes at the Quidditch Pitch Place in the Quidditch pitch Broom Trial Report back to Imelda Return to Albie Weekes Follow the Butterflies Talk to Clementine Willardsey Rewards: Conjuration Spellcraft Ghost of Our Love[50] Use the Map with Floating Candles to find the treasure Gobs of Gobstones Discover the painting's secret Rewards: Appearances The Lost Astrolabe Speak with the student on the dock Rewards: Appearances Speak with Gladwin Moon Rewards: Alohomora II & Alohomora III Talk to Lucan Brattleby Talk to Lucan Brattleby Purchase a broom enhancement from Albie Weekes The Tale of Rowland Oakes[56] Talk with Adelaide Oakes Rowland's map depicts a few key landmarks. Perhaps I can use them to help me work out where the goblins have taken him. Use Rowland's map to follow his trail Requirements: 10 - Suggested Level Rewards: Appearances This is the first Wizarding World media set primarily in Hogwarts that does not bear the \"Harry Potter\" title. On 16 September 2020, a trailer for Hogwarts Legacy was released. On 17 September 2020, Warner Bros. announced that Hogwarts Legacy is not a new story from J. K. Rowling, and she is not directly involved in the creation of the game.[57] Other wizards known to have lived at the time and place who are absent in the game include Armando Dippet, and Bathilda Bagshot. Interestingly, and perhaps mistakenly, promotional images appear to show the Hogwarts Whomping Willow and the Forbidden Forest Acromantula colony. They would be anachronisms, since they were founded long after the 1800s. The colony was founded by Aragog and Mosag in Rubeus Hagrid's third year at Hogwarts in 1943,"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk15",
    "text": "Bathilda Bagshot. Interestingly, and perhaps mistakenly, promotional images appear to show the Hogwarts Whomping Willow and the Forbidden Forest Acromantula colony. They would be anachronisms, since they were founded long after the 1800s. The colony was founded by Aragog and Mosag in Rubeus Hagrid's third year at Hogwarts in 1943, while the Whomping Willow was planted when Remus Lupin started at Hogwarts in 1971. Another anachronism, shown in the trailer, was a Hogwarts student riding an enchanted carriage to the school. However, Hogwarts would already have the Hogwarts Express at this time, as it was first in operation no later than the 1850s. It may be that the carriage was just an alternate method of transportation at the time. Another anachronism, shown in the trailer, was a Hogwarts student riding an enchanted carriage to the school. However, Hogwarts would already have the Hogwarts Express at this time, as it was first in operation no later than the 1850s. It may be that the carriage was just an alternate method of transportation at the time. A companion book, The Art and Making of Hogwarts Legacy, was also published. Extended footage of the game was released on 17 March 2022.[58] This footage shows characters using the Summoning Charm (Accio) to pull enemies towards themselves and then attack with another spell. However, outside this game this spell is only known to summon objects, not people or creatures, with the exception of Newt who subjected a pet to it to recover the creature,[59] and Ted Tonks who summoned a fish to eat.[60] This is actually addressed in a dialogue between Sebastian Sallow and Ominis Gaunt after the first Charms class. While Sebastian comments to the new student that they can use the charm on people, Ominis corrects him and states that the charm would actually have to be used on the clothes the targeted people are wearing.[61] This footage shows characters using the Summoning Charm (Accio) to pull enemies towards themselves and then attack with another spell. However, outside this game this spell is only known to summon objects, not people or creatures, with the exception of Newt who subjected a pet to it to recover the creature,[59] and Ted Tonks who summoned a fish to eat.[60] This is actually addressed in a dialogue between Sebastian Sallow and Ominis Gaunt after the first Charms class. While Sebastian comments to the new student that they can use the charm on people, Ominis corrects him and states that the charm would actually have to be used on the clothes the targeted people are wearing.[61] This is actually addressed in a dialogue between Sebastian Sallow and Ominis Gaunt after the first Charms class. While Sebastian comments to the new student that they can use the charm on people, Ominis corrects him and states that the charm would actually have to be used on the clothes the targeted people are wearing.[61] The students in this game wear different robes. They are coloured and gave the symbolic animals woven"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk16",
    "text": "the new student that they can use the charm on people, Ominis corrects him and states that the charm would actually have to be used on the clothes the targeted people are wearing.[61] The students in this game wear different robes. They are coloured and gave the symbolic animals woven into the back. On 12 August 2022, the release date was pushed back to 10 February 2023.[1] At Gamescon on 23 August, a new trailer was revealed showing the dark side, winning Best Trailer.[62][63] At the same time, it was revealed that PlayStation owners will have an exclusive quest. Preorders were announced and made available on 25 August. On 13 September 2022, the quest was revealed to be a time event for 1 year starting from the launch date. It featured the protagonist visiting Cassandra Mason at The Haunted Hogsmeade Shop.[64] Over 22 million copies were sold in 2023, with implication of more games.[65] A petition was started to ensure a hypothetical sequel to the game would not be live-service.[66] On 6 June 2024, the Summer update was released on every platform, bringing in content that was previously exclusive to PlayStation consoles. Content released included the Azkaban outfit, Felix Felicis potion recipe, and the Haunted Hogsmeade quest. Additionally, photo mode was released to all platforms.[67] On 30 January 2025, Avalanche Software released a new free update that enabled official mod support, only on PC. Players can use extensive mods to alter the game in various ways, whether it be the gameplay or cosmetic changes.[68] A \"Definitive Edition\" was in development in 2024 and early 2025, in which it would have added new storylines to the game. However, on 27 March 2025, Jason Schreier at Bloomberg reported it was cancelled due to corporate restructuring as well as the belief that the new content could not justify the price.[69] ↑ 1.0 1.1 1.2 Hogwarts Legacy on X: \"Hogwarts Legacy will launch on February 10, 2023 for PlayStation, Xbox, and PC. The Nintendo Switch launch date will be revealed soon. The team is excited for you to play, but we need a little more time to deliver the best possible game experience.\" ↑ 2.0 2.1 2.2 Hogwarts Legacy on X: \"We're overwhelmed with gratitude for the response to Hogwarts Legacy from fans around the globe. The team is working hard to deliver the best possible experience on all platforms and we need more time to do this. Hogwarts Legacy will launch for PS4 and Xbox One May 5, 2023.\" ↑ 3.0 3.1 Hogwarts Legacy on X: \"Hogwarts Legacy launches on Nintendo Switch on 11/14/23. We know fans are looking forward to playing on Switch, therefore creating the best possible experience is our top priority. Thank you for your patience. Available now on PS5 & PS4, Xbox X\" ↑ 4.0 4.1 4.2 4.3 4.4 4.5 4.6 Warner Bros. website ↑ Emre Kaya on X: \"While the ESA is trying to come up with a way to continue E3 digitally, many game companies/publishers have decided"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk17",
    "text": "priority. Thank you for your patience. Available now on PS5 & PS4, Xbox X\" ↑ 4.0 4.1 4.2 4.3 4.4 4.5 4.6 Warner Bros. website ↑ Emre Kaya on X: \"While the ESA is trying to come up with a way to continue E3 digitally, many game companies/publishers have decided to try their own thing similar to Nintendo's \"Nintendo Direct\". Warner Bros is one of these companies.\" ↑ Jason Schreier on X: \"I do\" ↑ Troy Leavitt on X: \"Yes! \"Soon\" (tm). :)\" ↑ James Sigfield on X: \"@jasonschreier already said it so fuck it. YES, WB is having an E3 conference this year to announce their full slate of games including Batman and their DC Game Universe, Harry Potter and more. BUT....\" ↑ Hogwarts Legacy – Writing for the Wizarding World in the 1800s ↑ Live the Unwritten in Thursday's Hogwarts Legacy State of Play ↑ Hogwarts Legacy: Your first look at extended gameplay ↑ 12.0 12.1 Chandler Wood on X: \"We've seen this question coming up and want to set the record straight. There are no microtransactions in Hogwarts Legacy.\" ↑ How Hogwarts Legacy taps PS5 features to make gameplay feel magical ↑ Autodesk presentation ↑ Hogwarts Legacy release date announced, and it brings disappointment ↑ Hogwarts Legacy’s new trailer shows the dark side of siding with Slytherin ↑ Hogwarts Legacy on X: \"Information regarding the Collector's Edition for Hogwarts Legacy will be revealed tomorrow, 8/24 at 6AM PT.\" ↑ Hogwarts Legacy is delayed yet again on some systems ↑ Hogwarts Legacy Delayed on PlayStation 4 and Xbox One - IGN ↑ 20.0 20.1 20.2 PS5 State of Play ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ 37.0 37.1 Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ 41.0 41.1 Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy Demiguise Statues: The Man Behind The Moons ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ J.K. Rowling ‘not directly"
  },
  {
    "source": "Hogwarts Legacy Overview",
    "chunk_id": "Hogwarts Legacy Overview_chunk18",
    "text": "Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy Demiguise Statues: The Man Behind The Moons ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ Hogwarts Legacy (see this video) ↑ J.K. Rowling ‘not directly involved’ in creation of Hogwarts Legacy game, Warner Bros. says (Archived) ↑ PlayStation on X: \"Wands at the ready for an all new State of Play focused on Hogwarts Legacy, featuring an extended first look at gameplay this Thursday, March 17 at 2 PM PT: http://play.st/34IDTcW\" ↑ Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay, Scene 48 ↑ Harry Potter and the Deathly Hallows, Chapter 15 (The Goblin's Revenge) ↑ Hogwarts Legacy, Main Quest \"Charms Class\" ↑ Hogwarts Legacy Wins Gamescom Award ↑ https://www.gamescom.global/en/news/z/hogwarts-legacy-shows-darker-sides-at-gamescomdead link ↑ A dark secret awaits in Hogwarts Legacy's Haunted Hogsmeade PlayStation exclusive quest (Archived) ↑ ‘Hogwarts Legacy’ Sold 22 Million Copies in 2023: Warner Bros. Discovery Games Boss Talks Year’s Top-Selling Title and What’s Next (EXCLUSIVE) (Archived) ↑ Hogwarts Legacy Fans Start Petition to Save Sequel (Archived) ↑ https://www.youtube.com/watch?v=i1n0iSq1byw ↑ https://www.youtube.com/watch?v=41xltDoIoEs ↑ Warner Bros. Cancels Planned ‘Hogwarts Legacy’ Game Expansion Hogwarts Legacy: The Official Game Guide Map:Hogwarts Legacy World Map Hogwarts Legacy's official website Hogwarts Legacy at the Internet Movie Database Hogwarts Legacy's official account on Facebook Hogwarts Legacy's official account on Instagram Hogwarts Legacy's official account on X Hogwarts Legacy's official channel on YouTube Hogwarts Legacy's official channel Discord server"
  }
]